#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  
	
Функция ПроверитьНомерЗаявкиСервер(Перевозчик,ДоговорПеревозки,НомерЗаявки,ДокументПеревозчика) Экспорт
		
	Отказ = Ложь;
	
	Запрос= Новый Запрос;
	Запрос.УстановитьПараметр("Перевозчик",Перевозчик);	
	Запрос.УстановитьПараметр("ДоговорПеревозки",ДоговорПеревозки);
	Запрос.УстановитьПараметр("НомерПоПорядку",НомерЗаявки);
	Запрос.УстановитьПараметр("ДокументПеревозчика",ДокументПеревозчика);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖБИ_НумераторПоПеревозчикамСрезПоследних.НомерПоПорядку КАК НомерПоПорядку
	               |ИЗ
	               |	РегистрСведений.ЖБИ_НумераторПоПеревозчикам.СрезПоследних(
	               |			,
	               |			Партнер = &Перевозчик
	               |				И ДоговорПеревозки = &ДоговорПеревозки) КАК ЖБИ_НумераторПоПеревозчикамСрезПоследних
	               |ГДЕ
	               |	ЖБИ_НумераторПоПеревозчикамСрезПоследних.НомерПоПорядку = &НомерПоПорядку
	               |	И ЖБИ_НумераторПоПеревозчикамСрезПоследних.ДокументПеревозчика <> &ДокументПеревозчика";		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

#Область Печать

Процедура ЖБИ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, МассивПечатныхФорм = Неопределено) Экспорт
	
	Печатать = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖБИ_ДоговорЗаявка");	
	Если Печатать Тогда
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'ЖБИ - ДоговорЗаявки'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЖБИ_ДоговорЗаявка",
		СинонимМакета,
		ЖБИСформироватьПечатнуюФормуДоговорЗаявка(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	Если МассивПечатныхФорм <> Неопределено Тогда 
		МассивПечатныхФорм.Добавить(ЖБИСформироватьПечатнуюФормуДоговорЗаявка(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));	
	КонецЕсли;
	
КонецПроцедуры

Функция ЖБИСформироватьПечатнуюФормуДоговорЗаявка(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ДОГОВОРЗАЯВКА";	
	НомерТипаДокумента 						= 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ЖБИ_ОбщийМодульПечать.ЗаполнитьТабличныйДокументДоговорЗаявка(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
