
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЖБИ_ФактическиеОтгрузки") Тогда
		//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		//ЭтотОбъект.УстановитьНовыйНомер();
		//ЭтотОбъект.Дата = ТекущаяДатаСеанса();
		//ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//Товары.Загрузить(ДанныеЗаполнения.СчетНаОплату.Выгрузить());
		//Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.Расчет;
	Иначе
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ можно добавить только на основании Фактические отгрузки");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	НомерПоПорядку  = 0;
	Запрос 		 	= Новый Запрос;
	Запрос.УстановитьПараметр("Перевозчик",Перевозчик);	
	Запрос.УстановитьПараметр("ДоговорПеревозки",Договор);
	Запрос.Текст = "ВЫБРАТЬ
					|	ЕСТЬNULL(МАКСИМУМ(ЖБИ_НумераторПоПеревозчикамСрезПоследних.НомерПоПорядку), 0) КАК НомерПоПорядку
					|ИЗ
					|	РегистрСведений.ЖБИ_НумераторПоПеревозчикам.СрезПоследних(,Партнер = &Перевозчик И ДоговорПеревозки = &ДоговорПеревозки) КАК ЖБИ_НумераторПоПеревозчикамСрезПоследних";		
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		НомерПоПорядку = РезультатЗапроса.НомерПоПорядку
	КонецЕсли;
	
	Если НомерЗаявки > НомерПоПорядку Тогда
		СообщениеОбОшибки	= "";
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Период",ТекущаяДатаСеанса());
		СтруктураПараметров.Вставить("Партнер",Перевозчик);
		СтруктураПараметров.Вставить("ДоговорПеревозки",Договор);
		СтруктураПараметров.Вставить("НомерПоПорядку",НомерЗаявки); 
		СтруктураПараметров.Вставить("ДокументПеревозчика",Ссылка);
		СтруктураПараметров.Вставить("Автор",Пользователи.ТекущийПользователь());
		ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_НумераторПоПеревозчикам.ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров);	
		Результат 			 = РегистрыСведений.ЖБИ_НумераторПоПеревозчикам.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
		Если Не Результат Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);
		КонецЕсли;		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Перевозчик",Перевозчик);	
	Запрос.УстановитьПараметр("ДоговорПеревозки",Договор);
	Запрос.УстановитьПараметр("НомерЗаявки",НомерЗаявки);
	Запрос.УстановитьПараметр("ТекущаяСсылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖБИ_ДоговорЗаявка.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЖБИ_ДоговорЗаявка КАК ЖБИ_ДоговорЗаявка
	               |ГДЕ
	               |	ЖБИ_ДоговорЗаявка.Перевозчик = &Перевозчик
	               |	И ЖБИ_ДоговорЗаявка.Договор = &ДоговорПеревозки
	               |	И ЖБИ_ДоговорЗаявка.НомерЗаявки = &НомерЗаявки
	               |	И ЖБИ_ДоговорЗаявка.Ссылка <> &ТекущаяСсылка
	               |	И НЕ ЖБИ_ДоговорЗаявка.ДокументОснование.ПометкаУдаления";	
    РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Договор заявка № " + Договор.Номер + "-" + НомерЗаявки + " уже существует " + РезультатЗапроса.Ссылка + " введите другой № заявки");
	КонецЕсли;
	
КонецПроцедуры
