
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаКлиенте
Функция ПолучитьИмяОперации()
	
	ИмяОперации = "";
	ИмяСтраницы = Элементы.СтраницыОсновнаяФорма.ТекущаяСтраница.Имя;	
	Если ИмяСтраницы = "СтраницаПоставщиков" Тогда
		ИмяОперации = "КомандаТаблицаПоставщиков";
		Элементы.КомандаТаблицаПоставщиков.Пометка = Истина;
	КонецЕсли;
	
	Возврат ИмяОперации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьПовышеннаяСкидкаСервер(Поставщик,ПроцентСкидки,СообщениеОбОшибки)	
	РезультатЗаписи = Обработки.ЖБИ_АРМЛогиста.ЗаполнитьПовышеннаяСкидкаПоПоставщику(Поставщик,ПроцентСкидки,СообщениеОбОшибки);	
	Возврат РезультатЗаписи;	
КонецФункции

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура ОтборПартнерПриИзменении(Элемент)	
	ЖБИ_ОбщийМодульОтчетыИОбработки.УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент,ТаблицаПоставщиков,ЭтотОбъект,"Поставщик",Неопределено);
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура КомандаИзменитьПовышеннаяСкидка(Команда)
	
	ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ЭтаФорма,"ТаблицаПоставщиков");
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураСобытия = Новый Структура("ИмяСобытия,Поставщик,ДопустимаяСкидка","ВводЗначенияЧислоПовышеннаяСкидка",ТекДанные.Поставщик,ТекДанные.ДопустимаяСкидка);
	ВыбЗнач = ТекДанные.ПовышеннаяСкидка;
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	КЧ = Новый КвалификаторыЧисла(10,2);
	ОписаниеТипов = Новый ОписаниеТипов(Массив, КЧ);
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, СтруктураСобытия);
	ПоказатьВводЗначения(Оповещение,ВыбЗнач, "Введите повышенную скидку% ", ОписаниеТипов);
	
КонецПроцедуры

#КонецОбласти

#Область ТаблицаПоставщиков

&НаКлиенте
Процедура ТаблицаПоставщиковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаПоставщиковПовышеннаяСкидка" Тогда
		КомандаИзменитьПовышеннаяСкидка("");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПоставщиковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПоставщиковПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура УстановитьПараметрыДинамическогоСписка()
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()

	ИмяОперации = ПолучитьИмяОперации();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(ЭтаФорма.Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
			Если ЭтаФорма.Параметры.Свойство(Реквизит.Имя) Тогда
				ЭтаФорма[Реквизит.Имя] = ЭтаФорма.Параметры[Реквизит.Имя];
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьДоступностьЭлементовФормы();
	Элементы.СтраницыОсновнаяФорма.ТекущаяСтраница = Элементы.СтраницаПоставщиков;
	ИмяОперации = ПолучитьИмяОперации();
	
	УстановитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
		Если ДополнительныеПараметры.Свойство("ИмяСобытия")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяСобытия) Тогда
			Если ДополнительныеПараметры.ИмяСобытия = "ВводЗначенияЧислоПовышеннаяСкидка" Тогда 				
				Если Результат = 0 
					ИЛИ Результат = Неопределено Тогда 
					Возврат;
				КонецЕсли;				
				Если Результат>ДополнительныеПараметры.ДопустимаяСкидка Тогда 
					ОбщегоНазначенияКлиент.СообщитьПользователю("Повышенная скидки не может быть больше Допустимой скидки");
					Возврат;
				КонецЕсли;				
				СообщениеОбОшибки = "";
				Поставщик = ДополнительныеПараметры.Поставщик;
				РезультатЗаписи = ЗаполнитьПовышеннаяСкидкаСервер(Поставщик,Результат,СообщениеОбОшибки);
				Если Не РезультатЗаписи Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибки);
				КонецЕсли;				
				Элементы.ТаблицаПоставщиков.Обновить();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Если  ДополнительныеПараметры = "ФормаРедактированиеПартнера" Тогда //редактирвоание партнера 
		//Элементы.ТаблицаПоставщиков.Обновить();
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти