#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ЗаполнитьНомерСпецификации() Экспорт
	
	НомерСпецификации  = 0;
	Запрос 			   = Новый Запрос;
	Запрос.Текст 	   = "ВЫБРАТЬ
	             	  |	ЕСТЬNULL(МАКСИМУМ(ЗаказПоставщику.ЖБИ_НомерСпецификации),0) КАК НомерСпецификации
	             	  |ИЗ
	             	  |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	             	  |ГДЕ
	             	  |	НЕ ЗаказПоставщику.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		НомерСпецификации = РезультатЗапроса.НомерСпецификации + 1;	
	КонецЕсли;
	
	Если НомерСпецификации = 0 Тогда
		НомерСпецификации = 1;
	КонецЕсли;
	
	Возврат НомерСпецификации;
	
КонецФункции

#КонецОбласти

&Перед("ДобавитьКомандыПечати")
Процедура ЖБИ_ДобавитьКомандыПечати(КомандыПечати)
	
	//ЖБИ_ЗаявкаПоставщику
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖБИ_ЗаявкаПоставщику";
	КомандаПечати.Представление = НСтр("ru = 'ЖБИ - Заявка поставщику'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖБИ_ЗаявкаПоставщикуКратко";
	КомандаПечати.Представление = НСтр("ru = 'ЖБИ - Заявка поставщику кратко'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖБИ_Спецификация";
	КомандаПечати.Представление = НСтр("ru = 'ЖБИ - Спецификация'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

//&Перед("Печать")
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, МассивПечатныхФорм = Неопределено) Экспорт
	
	Печатать = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖБИ_ЗаявкаПоставщику");	
	Если Печатать Тогда
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'ЖБИ - Заявка поставщику'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЖБИ_ЗаявкаПоставщику",
		СинонимМакета,
		ЖБИСформироватьПечатнуюФормуЗаявкаПоставщику(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
		Если МассивПечатныхФорм <> Неопределено Тогда 
			МассивПечатныхФорм.Добавить(ЖБИСформироватьПечатнуюФормуЗаявкаПоставщику(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));	
		КонецЕсли;	
	КонецЕсли;
	
	Печатать = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖБИ_ЗаявкаПоставщикуКратко");	
	Если Печатать Тогда
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'ЖБИ - Заявка поставщику кратко'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЖБИ_ЗаявкаПоставщикуКратко",
		СинонимМакета,
		ЖБИСформироватьПечатнуюФормуЗаявкаПоставщикуКратко(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
		Если МассивПечатныхФорм <> Неопределено Тогда 
			МассивПечатныхФорм.Добавить(ЖБИСформироватьПечатнуюФормуЗаявкаПоставщикуКратко(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));	
		КонецЕсли;	
	КонецЕсли;
	
	Печатать = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖБИ_Спецификация");	
	Если Печатать Тогда
		ПараметрыПечати.Вставить("Тип","ЖБИ_Спецификация");
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'ЖБИ - Спецификация'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЖБИ_Спецификация",
		СинонимМакета,
		ЖБИСформироватьПечатнуюФормуСпецификация(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
		Если МассивПечатныхФорм <> Неопределено Тогда 
			МассивПечатныхФорм.Добавить(ЖБИСформироватьПечатнуюФормуСпецификация(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция ЖБИСформироватьПечатнуюФормуЗаявкаПоставщику(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗАЯВКАПОСТАВШИКУ";	
	НомерТипаДокумента 						= 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ЖБИ_ОбщийМодульПечать.ЗаполнитьТабличныйДокументЗаявкаПоставщику(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЖБИСформироватьПечатнуюФормуЗаявкаПоставщикуКратко(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗАЯВКАПОСТАВШИКУКРАТКО";	
	НомерТипаДокумента 						= 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ЖБИ_ОбщийМодульПечать.ЗаполнитьТабличныйДокументЗаявкаПоставщикуКратко(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЖБИСформироватьПечатнуюФормуСпецификация(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_СПЕЦИФИКАЦИЯ";	
	НомерТипаДокумента 						= 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ);
		ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыЗаказаНаТоварыУслуги(МассивОбъектов, ПараметрыПечати);
		
		ЖБИ_ОбщийМодульПечать.ЗаполнитьТабличныйДокументСпецификация_ЗаказПоставщику(ТабличныйДокумент, МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецЕсли
