
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"ЖБИ_ЗаявкиПокупателей.Форма.ФормаДокумента") Тогда 
		ПараметрыФормы = Новый Структура("Основание", ПараметрыВыполненияКоманды.Источник.Объект.Ссылка);
		ОткрытьФорму("Документ.ЖБИ_ЗаявкиПокупателей.ФормаОбъекта", ПараметрыФормы);		
	ИначеЕсли СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"ЖБИ_ЗаявкиПокупателей.Форма.ФормаСписка") Тогда
		ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ПараметрыВыполненияКоманды.Источник,"Список");
		Если ТекДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;		
		ПараметрыФормы = Новый Структура("Основание", ТекДанные.Ссылка);
		ОткрытьФорму("Документ.ЖБИ_ЗаявкиПокупателей.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
		
КонецПроцедуры
