
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьУсловноеОформлениеТЧ(ИмяТаблицы,Свойство,ЗначениеСвойства,СписокКолонокИсключение,УдалитьУФИндекс = Неопределено, Очистить = Ложь)

	Если УдалитьУФИндекс <> Неопределено Тогда 
		УсловноеОформление.Элементы.Удалить(УдалитьУФИндекс);	
	КонецЕсли;
	
	Если Очистить Тогда 
		УсловноеОформление.Элементы.Очистить();	
	КонецЕсли;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Использование = Истина;
	ОформлениеУО        = ЭлементУсловногоОформления.Оформление;
	ОтборУО             = ЭлементУсловногоОформления.Отбор;
	ОформляемыеПоляУО   = ЭлементУсловногоОформления.Поля;
	Если ИмяТаблицы = "Товары"
		И Свойство = "ЦветТекста" Тогда 
		ОформлениеУО.УстановитьЗначениеПараметра(Свойство, ЗначениеСвойства);
		ЭлементОтбора                = ОтборУО.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект."+ИмяТаблицы+".Цена");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект."+ИмяТаблицы+".ЖБИ_ЦенаПоставщика");;
		ЭлементОтбора.Использование  = Истина;
		Для Каждого НомСтр Из Элементы[ИмяТаблицы].ПодчиненныеЭлементы Цикл
			ИмяКолонки = НомСтр.Имя;
			СокрИмя = Сред(ИмяКолонки,СтрДлина(ИмяТаблицы)+1,50);
			Если СписокКолонокИсключение.НайтиПоЗначению(СокрИмя)<>Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			ОформляемоеПоле      = ОформляемыеПоляУО.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонки);
		КонецЦикла;
	КонецЕсли;
	
	ОформляемоеПоле.Использование = Истина;
    
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

#Область ПриИзмененииРеквизитов

&НаКлиенте
&После("ТоварыЦенаПриИзменении")
Процедура ЖБИ_ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.ЖБИ_СуммаРазница = ТекущаяСтрока.Цена - ТекущаяСтрока.ЖБИ_ЦенаПоставщика;
	
	Если ТекущаяСтрока.Цена>ТекущаяСтрока.ЖБИ_ЦенаПоставщика Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Обратите внимание, цена больше закупочной!!!");		
		ЦветТекста = WebЦвета.Красный;
		УстановитьУсловноеОформлениеТЧ("Товары","ЦветТекста",ЦветТекста,Новый СписокЗначений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("ДоговорПриИзменении")
Процедура ЖБИ_ДоговорПриИзменении(Элемент)	
	Объект.ЖБИ_ПодписантПокупатель 	= ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Договор,"ЖБИ_ПодписантОрганизация").ЖБИ_ПодписантОрганизация;
	Объект.ЖБИ_ПодписантПоставщик 	= ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Договор,"ЖБИ_ПодписантКонтрагент").ЖБИ_ПодписантКонтрагент;	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
&После("ПослеЗаписи")
Процедура ЖБИ_ПослеЗаписи(ПараметрыЗаписи)
	
	Товары = Объект.Товары;
	Для Каждого НомСтр Из Товары Цикл
		НомСтр.ЖБИ_СуммаРазница = НомСтр.Цена - НомСтр.ЖБИ_ЦенаПоставщика;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
