
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ПолучитьПустуюТаблицуНаборЗаписей() Экспорт
	
	НаборЗаписей 		= РегистрыСведений.ЖБИ_РасчетИндЦен.СоздатьНаборЗаписей();	
	ТаблПлановыхСтавок 	= НаборЗаписей.ВыгрузитьКолонки();
	
	Возврат ТаблПлановыхСтавок;
	
КонецФункции

Функция СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,СтруктураПоиска = Неопределено,СообщениеОбОшибке) Экспорт
	
	Регистратор 	= ТаблицаНабораЗаписей[0].Регистратор;
	НаборЗаписей 	= РегистрыСведений.ЖБИ_РасчетИндЦен.СоздатьНаборЗаписей();
	Отбор 			= НаборЗаписей.Отбор;
	Отбор.Регистратор.Установить(Регистратор);		
	Для Каждого СтрокаНабораЗаписей Из ТаблицаНабораЗаписей Цикл	
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаНабораЗаписей);			
	КонецЦикла;
	
	Если НаборЗаписей.Количество()>0 Тогда
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
								
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции

Функция ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров) Экспорт 
	
	ТаблицаНабораЗаписей = ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр = ТаблицаНабораЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураПараметров);
	
	Возврат ТаблицаНабораЗаписей;
	
КонецФункции


#КонецОбласти