
Функция ГостНоменклатурыПоставщика(НоменклатураПоставщика) Экспорт 
	
	Гост		= "";
	Поставщик 	= НоменклатураПоставщика.Владелец;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("НоменклатураПоставщика",НоменклатураПоставщика);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ЖБИ_НоменклатураПоставщиков.НормативныйДокумент КАК НормативныйДокумент
	                |ИЗ
	                |	РегистрСведений.ЖБИ_НоменклатураПоставщиков КАК ЖБИ_НоменклатураПоставщиков
	                |ГДЕ
					|	ЖБИ_НоменклатураПоставщиков.Партнер = &Поставщик
					|	И ЖБИ_НоменклатураПоставщиков.НоменклатураПоставщика = &НоменклатураПоставщика";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Гост = РезультатЗапроса.НормативныйДокумент;	
	КонецЕсли;
	
	Возврат Гост;
	
КонецФункции
