
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ПолучитьПустуюТаблицуНаборЗаписей() Экспорт
	
	НаборЗаписей 		= РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьНаборЗаписей();	
	ТаблПлановыхСтавок 	= НаборЗаписей.ВыгрузитьКолонки();
	
	Возврат ТаблПлановыхСтавок;
	
КонецФункции

Функция СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей, СписокСвойствОбновления = Неопределено, СтруктураПоиска = Неопределено, СообщениеОбОшибке) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СтрокаНабораЗаписей Из ТаблицаНабораЗаписей Цикл	
		
		НаборЗаписей = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьНаборЗаписей();	
		Отбор = НаборЗаписей.Отбор;
		Отбор.Партнер.Установить(СтрокаНабораЗаписей.Партнер);
		Если СтруктураПоиска<>Неопределено Тогда
			Для Каждого СтрокаПоиска Из СтруктураПоиска Цикл 
				Отбор[СтрокаПоиска.Ключ].Установить(СтрокаПоиска.Значение);	
			КонецЦикла;
		КонецЕсли;		
		НаборЗаписей.Прочитать();	
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл
				
				Если СписокСвойствОбновления = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей);
				Иначе
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей, СписокСвойствОбновления);
				КонецЕсли;		
			КонецЦикла;
			
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		Иначе 
			МенеджерЗаписи = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаНабораЗаписей);
			
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
								
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции

Функция ПолучитьПараметрыЦенообразования(СтруктураОтбора) Экспорт	
	СтруктураПараметрыЦенообразования = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.Получить(СтруктураОтбора);
	Возврат СтруктураПараметрыЦенообразования;	
КонецФункции

#КонецОбласти