#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ИзменитьСтатусЗаявкиПодтверждениеЛогистами(ЗаявкаСсылка,СсылкаПодтверждение,Согласование,СообщениеОбОшибке) Экспорт
	
	Отказ = Ложь;
	
	ОбъекЗаявка = ЗаявкаСсылка.ПолучитьОбъект();
	
	////заполнение ставки	
	//Для Каждого НомСтр Из СсылкаПодтверждение.Товары Цикл
	//	СтруктураПараметров = Новый Структура("Пометка,Номенклатура,УкрупненнаяСтавка",Истина,НомСтр.Номенклатура,СсылкаПодтверждение.СуммаЗатратНаПеревозку);
	//	Документы.ЖБИ_ЗаявкиПокупателей.РасчитатьСтавкиТЧЗаявки(ОбъекЗаявка.ПредварительныйРасчет,СтруктураПараметров);
	//КонецЦикла;

	////заполнение ставки с учетом доп. затрат
	//ОбщиеДопРасходы = СсылкаПодтверждение.ДопЗатратыНаХвост + СсылкаПодтверждение.ДопЗатратыНаМатериалы;
	//Для Каждого НомСтр Из СсылкаПодтверждение.Товары Цикл
	//	СтруктураПараметров = Новый Структура("Номенклатура,Поставщик,ДопРасходыНаРейс",НомСтр.Номенклатура,СсылкаПодтверждение.Партнер,ОбщиеДопРасходы);
	//	Документы.ЖБИ_ЗаявкиПокупателей.РасчитатьСтавкиДопРасходыНаРейс(ОбъекЗаявка.ПредварительныйРасчет,СтруктураПараметров);
	//КонецЦикла;
	
	////расчет стоимости
	//ЖБИ_ОбщийМодульДокументы.РасчитатьСтоимость(ЗаявкаСсылка,ОбъекЗаявка.ОкончательныйРасчет,ОбъекЗаявка.КонтрольТранспорта);
	
	Согласовано = Согласование;
	СтруктураПоиска = Новый Структура("Поставщик",СсылкаПодтверждение.Партнер);
	НайденнаяСтрока = ОбъекЗаявка.КонтрольТранспорта.НайтиСтроки(СтруктураПоиска);
	Для Каждого НомСтр Из НайденнаяСтрока Цикл
		НомСтр.СогласованоОЛиЗ = НЕ Согласовано;	
	КонецЦикла;	
	
	СтатусЗавершен = Документы.ЖБИ_ЗаявкиПокупателей.МожноПереводитьДокументНаОкончательныйРасчет(ЗаявкаСсылка, СсылкаПодтверждение);
	Если СтатусЗавершен 
		И ЗаявкаСсылка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ПодтверждениеЛогистами Тогда 
		ОбъекЗаявка.Статус = Перечисления.ЖБИ_СтатусЗаявкиПокупателя.ОкончательныйРасчет;
		//расчет стоимости
		ЖБИ_ОбщийМодульДокументы.РасчитатьСтоимость(ЗаявкаСсылка,ОбъекЗаявка.ОкончательныйРасчет.Выгрузить(),ОбъекЗаявка.КонтрольТранспорта.Выгрузить());
	КонецЕсли;

	Попытка
		ОбъекЗаявка.Записать();
	Исключение
		СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Отказ = Истина;
		Возврат Отказ;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#КонецЕсли

