
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьКарточуНоменклатуры()
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	КарточкаНоменклатуры.Очистить();
	НастройкиВидимостиИЗаголовков 	= Справочники.Номенклатура.НастройкиВидимостиИЗаголовков(Номенклатура, Ложь);
	КарточкаНоменклатуры 			= Справочники.Номенклатура.ТабличныйДокументКарточкиНоменклатуры(Номенклатура, НастройкиВидимостиИЗаголовков);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьНоменклатуруСопоставления(НоменклатураПоставщика,Номенклатура,Очистить = Ложь,СообщениеОбОшибки = "")
	
	Отказ = Ложь;
	
	СпрОбъект = НоменклатураПоставщика.ПолучитьОбъект();
	Если Очистить Тогда
		СпрОбъект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	Иначе 
		СпрОбъект.Номенклатура = Номенклатура;
	КонецЕсли;
	
	Попытка
		СпрОбъект.Записать();
	Исключение
		Отказ = Истина;
		СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьНоменклатуруПоставщикаКопированием(НоменклатураПоставщика,ЦенаНоменклатурыКопирование,Поставщик,Номенклатура,Отказ = Ложь,СообщениеОбОшибки = "")
	
	Артикул = НоменклатураПоставщика.Артикул;
	СпрНоменклатураПоставщикаСсылка = Справочники.НоменклатураПоставщиков.НайтиПоРеквизиту("Артикул",Артикул,,Поставщик);
	Если СпрНоменклатураПоставщикаСсылка.Ссылка.Пустая() Тогда
		
		НачатьТранзакцию();
		
		//1 создать новую карточку номенклатуры поставщика
		СпрОбъект 				= Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		СпрОбъект.Владелец 		= Поставщик;
		СпрОбъект.Наименование 	= НоменклатураПоставщика.Наименование;
		СпрОбъект.Артикул 		= Артикул;
		СпрОбъект.Номенклатура  = Номенклатура;
		СпрОбъект.УстановитьНовыйКод();	
		Попытка
			СпрОбъект.Записать();
		Исключение
			Отказ = Истина;
			СообщениеОбОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		СпрНоменклатураПоставщикаСсылка = СпрОбъект.Ссылка;
		
		//2 создать новую цену поставщика
		ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПрайслистПоставщика.ПолучитьПустуюТаблицуНаборЗаписей();
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();	
		НоваяСтр.Период					= ТекущаяДатаСеанса();
		НоваяСтр.Партнер 				= Поставщик;
		НоваяСтр.НоменклатураПоставщика = СпрНоменклатураПоставщикаСсылка;
		НоваяСтр.Цена					= ЦенаНоменклатурыКопирование;
		НоваяСтр.Автор 					= Пользователи.ТекущийПользователь();
		
		//получим пред. цену и дату
		РегистрыСведений.ЖБИ_ПрайслистПоставщика.ЗаполнитьПредыдущуюЦену(ТаблицаНабораЗаписей,Поставщик);
		
		Результат 						= РегистрыСведений.ЖБИ_ПрайслистПоставщика.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
		Если Не Результат Тогда
			Отказ = Истина;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	Возврат СпрНоменклатураПоставщикаСсылка;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьВесАвтоИОбъем()  
	
	//ВесЧислитель = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Номенклатура,"ВесЧислитель");
	//Если ВесЧислитель <> Неопределено
	//	И ВесЧислитель>0 Тогда 
	//	Запись.ВесАвто 	= ВесЧислитель*Запись.НормаАвто;
	//КонецЕсли; 
	
	Запись.ВесАвто = Запись.Вес * Запись.НормаАвто;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНоменклатуруСопоставления()	
	Номенклатура 	= "";	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура ВесПриИзменении(Элемент)	
	РассчитатьВесАвтоИОбъем();
КонецПроцедуры

&НаКлиенте
Процедура НормаАвтоПриИзменении(Элемент)
	РассчитатьВесАвтоИОбъем();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПоставщикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда 	
		Текст = "Будет очищена номенклатура сопоставления: "+Номенклатура+"?";
		СтруктураСобытия = Новый Структура("ИмяСобытия","ВопросОчиститьНоменклатуруСопоставления");
		ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, СтруктураСобытия);
		ПоказатьВопрос(ОписаниеОповещения,Текст,РежимДиалогаВопрос.ДаНет,15);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
		
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
	СообщениеОбОшибки = "";
	Отказ = Ложь;
	Если ЗначениеЗаполнено(НоменклатураПоставщикаКопирование)
		И ЗначениеЗаполнено(Запись.Партнер) Тогда
		НоменклатураПоставщика = ЗаполнитьНоменклатуруПоставщикаКопированием(НоменклатураПоставщикаКопирование,ЦенаНоменклатурыКопирование,Запись.Партнер,Номенклатура,Отказ,СообщениеОбОшибки);
		
		Если Отказ Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СообщениеОбОшибки;
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		Запись.НоменклатураПоставщика = НоменклатураПоставщика;
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Отказ = Ложь;
	СообщениеОбОшибки = "";
	Если ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя]) Тогда
		Отказ = ЗаполнитьНоменклатуруСопоставления(Запись.НоменклатураПоставщика,Номенклатура,Ложь,СообщениеОбОшибки);
	Иначе 
		Отказ = ЗаполнитьНоменклатуруСопоставления(Запись.НоменклатураПоставщика,Номенклатура,Истина,СообщениеОбОшибки);
	КонецЕсли;	
	
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СообщениеОбОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("ЭтоКопирование") Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры);
	КонецЕсли;
	
	Артикул				= Запись.НоменклатураПоставщика.Артикул;
	Номенклатура 		= Запись.НоменклатураПоставщика.Номенклатура;
	ГруппаНоменклатуры	= Номенклатура.Родитель;	
	ОбщийВес 			= Запись.НормаАвто*Запись.Вес;	
	Если Не Параметры.ЗначениеКопирования.НоменклатураПоставщика.Пустая() Тогда 
		НоменклатураПоставщикаКопирование 	= Параметры.ЗначениеКопирования.НоменклатураПоставщика;
		ЦенаНоменклатурыКопирование			= РегистрыСведений.ЖБИ_ПрайслистПоставщика.ПолучитьАктуальнуюЦенуПоставщика(Запись.Партнер,Запись.НоменклатураПоставщика);
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Запись.Автор 		= ТекущийПользователь;
	
	ЗаполнитьКарточуНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
		Если ДополнительныеПараметры.Свойство("ИмяСобытия")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяСобытия) Тогда	
			Если ДополнительныеПараметры.ИмяСобытия = "ВопросОчиститьНоменклатуруСопоставления" Тогда 
				Если Результат = КодВозвратаДиалога.Нет ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
					Возврат;
				КонецЕсли;
				ОчиститьНоменклатуруСопоставления();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
