#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Перед("ДобавитьКомандыПечати")
Процедура ЖБИ_ДобавитьКомандыПечати(КомандыПечати, Порядок)
	//ЖБИ_ЗаявкаПоставщику
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЖБИ_ТТН";
	КомандаПечати.Представление = НСтр("ru = 'ЖБИ - ТТН'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
КонецПроцедуры

&Перед("Печать")
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, МассивПечатныхФорм = Неопределено) Экспорт		
	ЖБИ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, МассивПечатныхФорм);		
КонецПроцедуры

//&Перед("Печать")
Процедура ЖБИ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, МассивПечатныхФорм = Неопределено) Экспорт
	
	Печатать = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЖБИ_ТТН");	
	Если Печатать Тогда
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
		СинонимМакета = НСтр("ru = 'ЖБИ - ТТН'");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЖБИ_ТТН",
		СинонимМакета,
		ЖБИСформироватьПечатнуюФормуТТН(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	Если МассивПечатныхФорм <> Неопределено Тогда 
		МассивПечатныхФорм.Добавить(ЖБИСформироватьПечатнуюФормуТТН(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати));	
	КонецЕсли;
	
КонецПроцедуры

Функция ЖБИСформироватьПечатнуюФормуТТН(СтруктураТипов, МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		ТабличныйДокумент = ЖБИ_ОбщийМодульПечать.ЗаполнитьТабличныйДокументТТН(МассивОбъектов, ОбъектыПечати, ПараметрыПечати);	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецЕсли
