
#Область СлужебныеПроцедурыИФункци

Функция ОпределитьДоступностьРоли(Имя)	Экспорт 
	Результат = РольДоступна(Имя);
	Возврат Результат;
КонецФункции

#КонецОбласти


#Область ЖБИ_ЗаявкиПокупателей

Функция ДобавитьКомментарийВЧатСервер(СтруктураЗаписиЧата, СообщениеОбОшибки) Экспорт
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_Чат.ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр = ТаблицаНабораЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураЗаписиЧата);
	Результат = РегистрыСведений.ЖБИ_Чат.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
	
	Возврат Результат;
		
КонецФункции

Функция ПроверитьДопустимуюСкидкуПоставщика(Поставщик,Процент,СообщениеОбОшибки) Экспорт 
	
	Отказ = Ложь;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ЖБИ_ПараметрыЦенообразования.ДопустимаяСкидка, 0) КАК ДопустимаяСкидка
	               |ИЗ
	               |	РегистрСведений.ЖБИ_ПараметрыЦенообразования КАК ЖБИ_ПараметрыЦенообразования
	               |ГДЕ
	               |	ЖБИ_ПараметрыЦенообразования.Партнер = &Поставщик";	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		ДопустимаяСкидка = РезультатЗапроса.ДопустимаяСкидка;
		Если ДопустимаяСкидка>0
			И Процент > ДопустимаяСкидка Тогда 
			СообщениеОбОшибки = "Допустимый %скидки поставщика равен "+ДопустимаяСкидка;
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

