
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ПолучитьПустуюТаблицуНаборЗаписей() Экспорт
	
	НаборЗаписей 				= РегистрыСведений.ЖБИ_РасчетПредварительныхСтавок.СоздатьНаборЗаписей();	
	ТаблПредварительныхСтавок 	= НаборЗаписей.ВыгрузитьКолонки();
	
	Возврат ТаблПредварительныхСтавок;
	
КонецФункции

Функция СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей, СписокСвойствОбновления = Неопределено, СтруктураПоиска = Неопределено, СообщениеОбОшибке) Экспорт
	
	Для Каждого СтрокаНабораЗаписей Из ТаблицаНабораЗаписей Цикл	
		
		НаборЗаписей = РегистрыСведений.ЖБИ_РасчетПредварительныхСтавок.СоздатьНаборЗаписей();	
		Отбор = НаборЗаписей.Отбор;
		Отбор.ПунктОтгрузки.Установить(СтрокаНабораЗаписей.ПунктОтгрузки);
		Отбор.Регион.Установить(СтрокаНабораЗаписей.Регион);
		Отбор.Город.Установить(СтрокаНабораЗаписей.Город);
		Если СтруктураПоиска<>Неопределено Тогда
			Для Каждого СтрокаПоиска Из СтруктураПоиска Цикл 
				Отбор[СтрокаПоиска.Ключ].Установить(СтрокаПоиска.Значение);	
			КонецЦикла;
		КонецЕсли;		
		НаборЗаписей.Прочитать();	
		Если НаборЗаписей.Количество() > 0 Тогда
			Для Каждого Запись Из НаборЗаписей Цикл
				
				Если СписокСвойствОбновления = Неопределено Тогда 
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей);
				Иначе
					ЗаполнитьЗначенияСвойств(Запись, СтрокаНабораЗаписей, СписокСвойствОбновления);
				КонецЕсли;		
			КонецЦикла;
			
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		Иначе 
			МенеджерЗаписи = РегистрыСведений.ЖБИ_РасчетПредварительныхСтавок.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,СтрокаНабораЗаписей);
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
								
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции

Функция ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров) Экспорт 
	
	ТаблицаНабораЗаписей = ПолучитьПустуюТаблицуНаборЗаписей();
	НоваяСтр = ТаблицаНабораЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураПараметров);
	
	Возврат ТаблицаНабораЗаписей;
	
КонецФункции

Функция ОчиститьЗаписиРегистраСведений(ТаблицаНабораЗаписей, СообщениеОбОшибке) Экспорт
	
	Для Каждого НомСтр Из ТаблицаНабораЗаписей Цикл
		МенеджерЗаписи = РегистрыСведений.ЖБИ_РасчетПредварительныхСтавок.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,НомСтр);
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			Попытка
				МенеджерЗаписи.Удалить();
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(ПустаяСтрока(СообщениеОбОшибке),Истина,Ложь);
	
КонецФункции


#КонецОбласти