
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ПроверитьУникальностьНаименования(Наименование,Владелец)
	
	Отказ 		= Ложь;
	СпрСсылка 	= Справочники.КонтактныеЛицаПартнеров.НайтиПоНаименованию(Наименование,Истина,,Владелец);
	Если НЕ СпрСсылка.Пустая() Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаСервере
&После("КонтактнаяИнформацияПриСменеСтраницы")
Процедура ЖБИ_КонтактнаяИнформацияПриСменеСтраницы()	
	Для Каждого Элемент Из Элементы Цикл
		Если СтрНайти(Элемент.Заголовок,"телефон")>0
			ИЛИ СтрНайти(Элемент.Заголовок,"Телефон")>0 Тогда
			Для Каждого Эл Из Элемент.ПодчиненныеЭлементы Цикл 
				Если ТипЗнч(Эл) = Тип("ПолеФормы") Тогда 
					Эл.РедактированиеТекста = Ложь;
					//Эл.Доступность 			= Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЖБИ_Должность(Элемент)	
	Объект.ДолжностьПоВизитке = Объект.ЖБИ_Должность;			
КонецПроцедуры

&НаСервере
&После("ПередЗаписьюНаСервере")
Процедура ЖБИ_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	Отказ = ПроверитьУникальностьНаименования(Объект.Наименование,Объект.Владелец);
	Если Отказ Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Контактное лицо " + Объект.Наименование + " дублируется");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ


#КонецОбласти



