

#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаКлиенте
Процедура УстановитьПараметрыДинамическогоСписка()

	//ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварыНаполнениеРейса,
	//"Ссылка",
	//ПредопределенноеЗначение("Документ.ЖБИ_ФактическиеОтгрузки.ПустаяСсылка"));
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

#Область Команды

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Для Каждого НомСтр Из Элементы.ТаблицаОЛИЗ.ВыделенныеСтроки Цикл
		ДанныеСтроки 	= Элементы.ТаблицаОЛИЗ.ДанныеСтроки(НомСтр);
		НоваяСтрока		= Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ДанныеСтроки);		 
	КонецЦикла;
	
	Если Товары.Количество()>0 Тогда 
		ОповеститьОВыборе(Новый Структура("Товары", Товары));
	Иначе 
		ЭтаФорма.Закрыть()	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Отборы


#КонецОбласти

#КонецОбласти

#Область Список

&НаКлиенте
Процедура ТаблицаОЛИЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	КомандаВыбрать("");	
КонецПроцедуры

#КонецОбласти


#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(ЭтаФорма.Параметры) = Тип("ДанныеФормыСтруктура") Тогда
		Для Каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
			Если ЭтаФорма.Параметры.Свойство(Реквизит.Имя) Тогда
				ЭтаФорма[Реквизит.Имя] = ЭтаФорма.Параметры[Реквизит.Имя];
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьДоступностьЭлементовФормы();
	УстановитьПараметрыДинамическогоСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
			
	КонецЕсли;	
	
	Если ДополнительныеПараметры = "КомандаИзменитьФактическиеОтгрузки" Тогда
		Элементы.Список.Обновить();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти