
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция СоздатьМаршрутДляРасчетаСтавки(ПунктОтгрузки,ПунктНазначения,МаршрутСсылка,СообщениеОбОшибке) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктОтгрузки",ПунктОтгрузки);
	Запрос.УстановитьПараметр("ПунктНазначения",ПунктНазначения);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖБИ_Маршрут.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЖБИ_Маршрут КАК ЖБИ_Маршрут
	               |ГДЕ
	               |	ЖБИ_Маршрут.ПунктОтгрузки = &ПунктОтгрузки
	               |	И ЖБИ_Маршрут.ПунктНазначения = &ПунктНазначения";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		МаршрутСсылка = РезультатЗапроса.Ссылка;
	Иначе 
		СпрОбъект = Справочники.ЖБИ_Маршрут.СоздатьЭлемент();
		СпрОбъект.УстановитьНовыйКод();
		СпрОбъект.ПунктОтгрузки = ПунктОтгрузки;
		СпрОбъект.ПунктНазначения = ПунктНазначения;
		Попытка
			СпрОбъект.Записать();
			МаршрутСсылка = СпрОбъект.Ссылка;
		Исключение
			СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Функция ПолучитьМаршрутПоОтбору(ПунктОтгрузки,ПунктНазначения) Экспорт
	
	МаршрутСсылка = Справочники.ЖБИ_Маршрут.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПунктОтгрузки",ПунктОтгрузки);
	Запрос.УстановитьПараметр("ПунктНазначения",ПунктНазначения);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЖБИ_Маршрут.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЖБИ_Маршрут КАК ЖБИ_Маршрут
	               |ГДЕ
	               |	ЖБИ_Маршрут.ПунктОтгрузки = &ПунктОтгрузки
	               |	И ЖБИ_Маршрут.ПунктНазначения = &ПунктНазначения";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		МаршрутСсылка = РезультатЗапроса.Ссылка;
	КонецЕсли;
	
	Возврат МаршрутСсылка;
	
КонецФункции

#КонецОбласти