
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьПолеФорматированногоДокумента()
	
	Если Не Объект.Ссылка.Пустая() Или ЗначениеЗаполнено(Объект.ТекстHTML) Тогда		
		СтруктураВложений  = Новый Структура;
		Объект.ТекстHTML   = ЖБИ_Взаимодействия.ОбработатьТекстHTMLДляФорматированногоДокумента(
							Объект.Ссылка, Объект.ТекстHTML, СтруктураВложений);
		ТекстПисьмаФорматированныйДокумент.УстановитьHTML(Объект.ТекстHTML, СтруктураВложений);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти	

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	//ЗаполнитьПолеФорматированногоДокумента();	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ДокументHTMLТекущегоПисьмаПодготовлен = Ложь;
	//ТаблицаСоответствийИменВложенийИдентификаторам.Очистить();
	//
	//СтруктураВложений = Новый Структура;
	//ТекстПисьмаФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.ТекстHTML, СтруктураВложений);
	//Для каждого Вложение Из СтруктураВложений Цикл
	//	НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
	//	НоваяСтрока.ИмяФайла = Вложение.Ключ;
	//	НоваяСтрока.ИдентификаторФайлаДляHTML = Новый УникальныйИдентификатор;
	//	НоваяСтрока.Картинка = Вложение.Значение;		
	//КонецЦикла;
	//
	//Если ТаблицаСоответствийИменВложенийИдентификаторам.Количество() > 0 Тогда		
	//	ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекущийОбъект.ТекстHTML);
	//	Взаимодействия.ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML(
	//				ДокументHTML, ТаблицаСоответствийИменВложенийИдентификаторам.Выгрузить());
	//	ДокументHTMLТекущегоПисьмаПодготовлен = Истина;	
	//КонецЕсли;
	//
	//Если ДокументHTMLТекущегоПисьмаПодготовлен Тогда		
	//	ТекущийОбъект.ТекстHTML = Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);		
	//КонецЕсли;
	
	ТекущийОбъект.ТекстHTML =
			Новый ХранилищеЗначения(ТекстПисьмаФорматированныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Подпись = ТекущийОбъект.Ссылка;	
	//
	//УстановитьПривилегированныйРежим(Истина);
	//
	//// Добавим в список удаленных вложений ранее сохраненные картинки, отображаемые в теле форматированного документа.
	//ТаблицаВложенийКартинокФорматированногоДокумента = ЖБИ_Взаимодействия.ПолучитьВложенияПисьмаСНеПустымИД(Подпись);
	//Для каждого Вложение Из ТаблицаВложенийКартинокФорматированногоДокумента Цикл
	//	УдаленныеВложения.Добавить(Вложение.Ссылка);
	//КонецЦикла;
	//
	//// Удалим удаленные вложения
	//Для Каждого УдаленноеВложение Из УдаленныеВложения Цикл
	//	ОбъектВложение = УдаленноеВложение.Значение.ПолучитьОбъект();
	//	ОбъектВложение.Удалить();
	//КонецЦикла;
	//УдаленныеВложения.Очистить();
	//	
	//Для каждого Вложение Из ТаблицаСоответствийИменВложенийИдентификаторам Цикл
	//	
	//	ДвоичныеДанныеКартинки = Вложение.Картинка.ПолучитьДвоичныеДанные();
	//	АдресКартинкиВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
	//	
	//	ПараметрыВложения = Новый Структура;
	//	ПараметрыВложения.Вставить("ИмяФайла", "_" + СтрЗаменить(Вложение.ИдентификаторФайлаДляHTML, "-", "_"));
	//	ПараметрыВложения.Вставить("Размер", ДвоичныеДанныеКартинки.Размер());
	//	ПараметрыВложения.Вставить("ИДФайлаЭлектронногоПисьма", Вложение.ИдентификаторФайлаДляHTML);
	//	
	//	ПрисоединенныйФайл = УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
	//						Подпись, АдресКартинкиВоВременномХранилище, ПараметрыВложения);
	//	
	//КонецЦикла;
	//	
	//УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТекстПисьмаФорматированныйДокумент = ТекущийОбъект.ТекстHTML.Получить();
	
КонецПроцедуры

#КонецОбласти

