

#Область Отборы

&НаСервере
Процедура УстановитьОтборДинСпискаПоСегменту(СписокСегмент, Список, ИмяОтбора, ВидСравнения) Экспорт
	
	Если СписокСегмент.Количество()=0 Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,ИмяОтбора);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСегмент", СписокСегмент);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ПартнерыСегмента.Партнер
					|ИЗ
					|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
					|ГДЕ
					|	ПартнерыСегмента.Сегмент В (&СписокСегмент)";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	МассивПартнеров = РезультатЗапроса.ВыгрузитьКолонку("Партнер");
	Если МассивПартнеров.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, ИмяОтбора, МассивПартнеров, ВидСравнения, , );
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, ИмяОтбора, МассивПартнеров, ВидСравнения, , );	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинамическогоСпискаПоЭлементу(Элемент,Список,ЭтотОбъект,ИмяОтбора,ВидСравнения,ПроверятьЗаполнение = Ложь) Экспорт 
	
	Если ЗначениеЗаполнено(ЭтотОбъект[Элемент.Имя])
		ИЛИ ПроверятьЗаполнение Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, ИмяОтбора, ЭтотОбъект[Элемент.Имя], ВидСравнения, , );
	Иначе 
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,ИмяОтбора);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти