
Функция СоздатьОбновитьЗаписиРегистраСведенийПоРегионуПоставщика(ТаблицаНабораЗаписей,СообщениеОбОшибке) Экспорт
	
	Результат = Истина;
	Если ТаблицаНабораЗаписей.Количество() = 0 Тогда 
		Возврат Результат;
	КонецЕсли;
	
	ДанныеСтр = ТаблицаНабораЗаписей[0];
	Запрос 	  = Новый Запрос;
	Запрос.УстановитьПараметр("РегионОткуда",ДанныеСтр.ПунктОтгрузки.Регион);
	Запрос.УстановитьПараметр("ГородОткуда",ДанныеСтр.ПунктОтгрузки.Город);	
	Запрос.УстановитьПараметр("РегионКуда",ДанныеСтр.Регион);
	Запрос.УстановитьПараметр("ГородКуда",ДанныеСтр.Город);
	Запрос.Текст =  "ВЫБРАТЬ
					//|	ЖБИ_РасчетПредварительныхСтавок.ПунктОтгрузки.Владелец КАК Владелец,
					|	ЖБИ_РасчетПредварительныхСтавок.ПунктОтгрузки КАК ПунктОтгрузки,
					|	ЖБИ_РасчетПредварительныхСтавок.Регион КАК Регион,
					|	ЖБИ_РасчетПредварительныхСтавок.Город КАК Город,
					|	ЖБИ_РасчетПредварительныхСтавок.Адрес КАК Адрес,
					|	ЖБИ_РасчетПредварительныхСтавок.АдресЗначенияПолей КАК АдресЗначенияПолей,
					|	ЖБИ_РасчетПредварительныхСтавок.Расстояние КАК Расстояние,
					|	ЖБИ_РасчетПредварительныхСтавок.Ставка КАК Ставка,
					|	ЖБИ_РасчетПредварительныхСтавок.ДатаОбновления КАК ДатаОбновления,
					|	ЖБИ_РасчетПредварительныхСтавок.Автор КАК Автор,
					|	ЖБИ_РасчетПредварительныхСтавок.Комментарий КАК Комментарий
					|ИЗ
					|	РегистрСведений.ЖБИ_РасчетПредварительныхСтавок КАК ЖБИ_РасчетПредварительныхСтавок
					|ГДЕ
					|	ЖБИ_РасчетПредварительныхСтавок.ПунктОтгрузки.Регион = &РегионОткуда
					|	И ЖБИ_РасчетПредварительныхСтавок.ПунктОтгрузки.Город = &ГородОткуда
					|	И ЖБИ_РасчетПредварительныхСтавок.Регион = &РегионКуда
					|	И ЖБИ_РасчетПредварительныхСтавок.Город = &ГородКуда
					|	И ЖБИ_РасчетПредварительныхСтавок.Ставка = 0"; 		
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 		
		МенеджерЗаписи = РегистрыСведений.ЖБИ_РасчетПредварительныхСтавок.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,РезультатЗапроса);
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,РезультатЗапроса);
			МенеджерЗаписи.Расстояние 		= ДанныеСтр.Расстояние;
			МенеджерЗаписи.Ставка 			= ДанныеСтр.Ставка;
			МенеджерЗаписи.ДатаОбновления 	= ТекущаяДатаСеанса();
			Попытка
				МенеджерЗаписи.Записать(Истина);
			Исключение
				СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		        Результат = Ложь;
				Прервать;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьСкидкуПоПоставщику(МассивНоменклатуры,Поставщик,ПроцентСкидки,СообщениеОбОшибки) Экспорт 
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_СкидкиПоставщика.ПолучитьПустуюТаблицуНаборЗаписей();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец",Поставщик);
	Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураПоставщиков.Ссылка КАК НоменклатураПоставщика,
	               |	НоменклатураПоставщиков.Владелец КАК Партнер
	               |ИЗ
	               |	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	               |ГДЕ
	               |	НЕ НоменклатураПоставщиков.ПометкаУдаления
	               |	И НоменклатураПоставщиков.Владелец = &Владелец
				   |	И &Условие";
	
	Если МассивНоменклатуры.Количество()>0 Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие","НоменклатураПоставщиков.Ссылка В (&МассивНоменклатуры)");	
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие","Истина");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,РезультатЗапроса);
		НоваяСтр.ПроцентСкидки = ПроцентСкидки;
		НоваяСтр.Автор = Пользователи.ТекущийПользователь();
	КонецЦикла;
	
	СписокСвойствОбновления = "ПроцентСкидки";
	Результат = РегистрыСведений.ЖБИ_СкидкиПоставщика.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,,СообщениеОбОшибки);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДопустимуюСкидкуПоПоставщику(Поставщик,ПроцентСкидки,СообщениеОбОшибки) Экспорт 
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.ПолучитьПустуюТаблицуНаборЗаписей();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖБИ_ПараметрыЦенообразования.Партнер КАК Партнер
	               |ИЗ
	               |	РегистрСведений.ЖБИ_ПараметрыЦенообразования КАК ЖБИ_ПараметрыЦенообразования
				   |ГДЕ
				   |	ЖБИ_ПараметрыЦенообразования.Партнер = &Поставщик";
	
	ДобвитьЗапись = Истина;
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,РезультатЗапроса);
		НоваяСтр.ДопустимаяСкидка = ПроцентСкидки;
		НоваяСтр.Автор = Пользователи.ТекущийПользователь();
		ДобвитьЗапись = Ложь;
	КонецЦикла;
	
	СписокСвойствОбновления = "";
	Если ДобвитьЗапись Тогда 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		НоваяСтр.Партнер = Поставщик;
		НоваяСтр.ДопустимаяСкидка = ПроцентСкидки;
		НоваяСтр.Автор = Пользователи.ТекущийПользователь();
	Иначе 
		СписокСвойствОбновления = "ДопустимаяСкидка";
	КонецЕсли;
	
	Результат = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,,СообщениеОбОшибки);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьПовышеннаяСкидкаПоПоставщику(Поставщик,ПроцентСкидки,СообщениеОбОшибки) Экспорт 
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.ПолучитьПустуюТаблицуНаборЗаписей();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖБИ_ПараметрыЦенообразования.Партнер КАК Партнер
	               |ИЗ
	               |	РегистрСведений.ЖБИ_ПараметрыЦенообразования КАК ЖБИ_ПараметрыЦенообразования
				   |ГДЕ
				   |	ЖБИ_ПараметрыЦенообразования.Партнер = &Поставщик";
	
	ДобвитьЗапись = Истина;
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,РезультатЗапроса);
		НоваяСтр.ПовышеннаяСкидка = ПроцентСкидки;
		НоваяСтр.Автор = Пользователи.ТекущийПользователь();
		ДобвитьЗапись = Ложь;
	КонецЦикла;
	
	СписокСвойствОбновления = "";
	Если ДобвитьЗапись Тогда 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		НоваяСтр.Партнер = Поставщик;
		НоваяСтр.ПовышеннаяСкидка = ПроцентСкидки;
		НоваяСтр.Автор = Пользователи.ТекущийПользователь();
	Иначе 
		СписокСвойствОбновления = "ПовышеннаяСкидка";
	КонецЕсли;
	
	Результат = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,,СообщениеОбОшибки);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьЗаполнитьПроцентНаценкиПоПоставщику(Поставщик,ПроцентНаценки,СообщениеОбОшибки) Экспорт 
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.ПолучитьПустуюТаблицуНаборЗаписей();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖБИ_ПараметрыЦенообразования.Партнер КАК Партнер
	               |ИЗ
	               |	РегистрСведений.ЖБИ_ПараметрыЦенообразования КАК ЖБИ_ПараметрыЦенообразования
				   |ГДЕ
				   |	ЖБИ_ПараметрыЦенообразования.Партнер = &Поставщик";
	
	ДобвитьЗапись = Истина;
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,РезультатЗапроса);
		НоваяСтр.ПроцентНаценки = ПроцентНаценки;
		НоваяСтр.Автор 			= Пользователи.ТекущийПользователь();
		ДобвитьЗапись 			= Ложь;
	КонецЦикла;
	
	СписокСвойствОбновления = "";
	Если ДобвитьЗапись Тогда 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		НоваяСтр.Партнер = Поставщик;
		НоваяСтр.ПроцентНаценки = ПроцентНаценки;
		НоваяСтр.Автор = Пользователи.ТекущийПользователь();
	Иначе 
		СписокСвойствОбновления = "ПроцентНаценки";
	КонецЕсли;
	
	Результат = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,,СообщениеОбОшибки);
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьТранспортныйПроцент(Поставщик,ТранспортныйПроцент,СообщениеОбОшибки) Экспорт 
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.ПолучитьПустуюТаблицуНаборЗаписей();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖБИ_ПараметрыЦенообразования.Партнер КАК Партнер
	               |ИЗ
	               |	РегистрСведений.ЖБИ_ПараметрыЦенообразования КАК ЖБИ_ПараметрыЦенообразования
				   |ГДЕ
				   |	ЖБИ_ПараметрыЦенообразования.Партнер = &Поставщик";
	
	ДобвитьЗапись = Истина;
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр,РезультатЗапроса);
		НоваяСтр.ПовышающийПроцент 	= ТранспортныйПроцент;
		НоваяСтр.Автор 				= Пользователи.ТекущийПользователь();
		ДобвитьЗапись 				= Ложь;
	КонецЦикла;
	
	СписокСвойствОбновления = "";
	Если ДобвитьЗапись Тогда 
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		НоваяСтр.Партнер 				= Поставщик;
		НоваяСтр.ПовышающийПроцент 		= ТранспортныйПроцент;
		НоваяСтр.Автор = Пользователи.ТекущийПользователь();
	Иначе 
		СписокСвойствОбновления = "ПовышающийПроцент";
	КонецЕсли;
	
	Результат = РегистрыСведений.ЖБИ_ПараметрыЦенообразования.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,,СообщениеОбОшибки);
	
	Возврат Результат;
	
КонецФункции 

Функция ЗаполнитьЦенуПоставщика(МассивНоменклатуры,Поставщик,ЦенаПоставщика,СообщениеОбОшибки) Экспорт 
	
	ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_ПрайслистПоставщика.ПолучитьПустуюТаблицуНаборЗаписей();
	Для Каждого СтрокаТЧ Из МассивНоменклатуры Цикл
		НоваяСтр = ТаблицаНабораЗаписей.Добавить();
		НоваяСтр.Партнер 				= Поставщик;
		НоваяСтр.НоменклатураПоставщика = СтрокаТЧ;
		НоваяСтр.Цена 					= ЦенаПоставщика;
		НоваяСтр.Период					= ТекущаяДатаСеанса();
		НоваяСтр.Автор 					= Пользователи.ТекущийПользователь();
	КонецЦикла;
	
	СписокСвойствОбновления = "Цена";
	Результат = РегистрыСведений.ЖБИ_ПрайслистПоставщика.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,СписокСвойствОбновления,, СообщениеОбОшибки);
	
	Возврат Результат;
	
КонецФункции