
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаКлиенте
Процедура УстановитьОтборПоУмолчаниюДинамическогоСписка()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Партнер", Партнер, Неопределено);	
	
КонецПроцедуры


#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура КомандаВыбрать(Команда)	
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.ПунктНазначенияОтгрузки);	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КомандаВыбрать("");
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Не Параметры.Свойство("Партнер")
		И НЕ ЗначениеЗаполнено(Параметры.Партнер) Тогда 
		Возврат;
	КонецЕсли;
	
	Партнер = Параметры.Партнер;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	УстановитьОтборПоУмолчаниюДинамическогоСписка();	
КонецПроцедуры

#КонецОбласти

