
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

Функция ЯвляетсяЧислом(Значение) Экспорт
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Если Значение = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;

		Попытка
			Р = Число(Значение);
		Исключение
			Возврат Ложь;
		КонецПопытки;
			Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти

&После("ОбработкаЗаполнения")
Процедура ЖБИ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено
		ИЛИ НЕ ДанныеЗаполнения.Свойство("Партнер") Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаАктуальности 	= ТекущаяДатаСеанса();
	Если ДанныеЗаполнения.Свойство("НомерЗаказа") Тогда
		Номер = ДанныеЗаполнения.НомерЗаказа;
	Иначе 
		Номер = Строка(Формат(Справочники.ДоговорыКонтрагентов.ЗаполнитьНомерПоПорядку(),"ЧГ=0")) + "-П";	
	КонецЕсли;
	
	Дата  				= ДатаАктуальности;
	Если ДанныеЗаполнения.Партнер.Клиент
		ИЛИ ДанныеЗаполнения.Партнер.Поставщик Тогда
		Наименование = "Договор поставки №" + Номер;
	Иначе 
		Наименование = "Договор №" + Номер;
	КонецЕсли;
	
	НаименованиеДляПечати = Наименование;
		
	СтруктураОтветственных 				= ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(Организация, ДатаАктуальности);
	ЖБИ_ПодписантОрганизация			= СтруктураОтветственных.РуководительСсылка;
	ЖБИ_ОснованиеСоСтороныОрганизации	= "Устава";
	Подразделение						= Пользователи.ТекущийПользователь().Подразделение;
	
	ЖБИ_ОснованиеСоСтороныКонтрагента	= "Устава";
	
КонецПроцедуры

&После("ПриЗаписи")
Процедура ЖБИ_ПриЗаписи(Отказ)
		
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номер) Тогда
		НомерПоПорядку		= СтрЗаменить(Номер,"-П","");
		Если НЕ ЯвляетсяЧислом(НомерПоПорядку) Тогда 
			Возврат;
		КонецЕсли;
		СообщениеОбОшибки 	= "";
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Период",ТекущаяДатаСеанса());
		СтруктураПараметров.Вставить("Договор",Ссылка);
		СтруктураПараметров.Вставить("НомерПоПорядку",НомерПоПорядку);
		СтруктураПараметров.Вставить("Автор",Пользователи.ТекущийПользователь());
		ТаблицаНабораЗаписей = РегистрыСведений.ЖБИ_НумераторПоДоговорам.ЗаполнитьТаблицуНабораЗаписей(СтруктураПараметров);	
		Результат 			 = РегистрыСведений.ЖБИ_НумераторПоДоговорам.СоздатьОбновитьЗаписиРегистраСведений(ТаблицаНабораЗаписей,,, СообщениеОбОшибки);
		Если Не Результат Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибки);
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
