
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьТипСообщенияПоУмолчаниюСервер(ТекДанные)	
	
	НачатьТранзакцию();
	
	Запрос 		 = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖБИ_ШаблонПочтовыхСообщений.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЖБИ_ШаблонПочтовыхСообщений КАК ЖБИ_ШаблонПочтовыхСообщений
				   |ГДЕ
				   |	НЕ ЖБИ_ШаблонПочтовыхСообщений.ПометкаУдаления
				   |	И ЖБИ_ШаблонПочтовыхСообщений.ПоУмолчанию";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		СпрОбъект 				= РезультатЗапроса.Ссылка.ПолучитьОбъект();
		СпрОбъект.ПоУмолчанию 	= Ложь;
		СпрОбъект.Записать();
	КонецЦикла;
	
	СпрОбъект = ТекДанные.Ссылка.ПолучитьОбъект();
	СпрОбъект.ПоУмолчанию = Истина;
	СпрОбъект.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуШаблонаПисем(ТипСообщенияШаблон)
	
	//Если ТипСообщенияШаблон = "Тема письма" Тогда 
	//	ТипСообщения = ПредопределенноеЗначение("Перечисление.ЖБИ_ТипыСообщения.ТемаПисьма");	
	//Иначе 
	//	ТипСообщения = ПредопределенноеЗначение("Перечисление.ЖБИ_ТипыСообщения.ТекстПисьма");
	//КонецЕсли;
	//
	//ДанныеЗаполнения = Новый Структура("ТипСообщения",ТипСообщения);
	//ОткрытьФорму("Справочник.ЖБИ_ШаблонПочтовыхСообщений.Форма.ФормаЭлемента",
	//	Новый Структура("ЗначенияЗаполнения",ДанныеЗаполнения),
	//	ЭтаФорма,,,,
	//	Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, "ФормаСозданияШаблонПочтовыхСообщений"),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

#Область Команды

&НаКлиенте
Процедура КомандаПоУмолчанию(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ЗаполнитьТипСообщенияПоУмолчаниюСервер(ТекДанные);
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Отказ = Истина;
	//
	//СписокКоманд = Новый СписокЗначений;
	//СписокКоманд.Добавить("Тема письма");
	//СписокКоманд.Добавить("Текст письма");
	//
	//СтруктураСобытия = Новый Структура("ИмяСобытия","СписокПередНачаломДобавления");
	//ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, СтруктураСобытия);
	//ПоказатьВыборИзМеню(ОписаниеОповещения, СписокКоманд);
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = Новый Структура("СообщениеОбОшибке","");	
	Если Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда 
		Если ДополнительныеПараметры.Свойство("ИмяСобытия")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяСобытия) Тогда
			Если ДополнительныеПараметры.ИмяСобытия = "СписокПередНачаломДобавления" Тогда
				Если Результат = Неопределено Тогда
					Возврат;
				КонецЕсли;
				ОткрытьФормуШаблонаПисем(Результат);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти