
&НаСервере
Процедура ИзменитьОбъект(Пар)
	
	Если Пар = 1 Тогда 
		ДокОбъект = ЗаявкаПокупателя.ПолучитьОбъект();
		ДокОбъект.Статус = СтатусЗаявки;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
	ИначеЕсли Пар = 2 Тогда
		ДокОбъект = РасчетПлановыхСтавок.ПолучитьОбъект();
		ДокОбъект.Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.Расчет;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
	ИначеЕсли Пар = 3 Тогда
		ДокОбъект = ПодтверждениеЛогиста.ПолучитьОбъект();
		ДокОбъект.Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.Расчет;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
	ИначеЕсли Пар = 4 Тогда
		ДокОбъект = ИндивидуальныеУсловияПоставки.ПолучитьОбъект();
		ДокОбъект.Статус = Перечисления.ЖБИ_СтатусРасчетаСтавки.Расчет;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
	ИначеЕсли Пар = 5 Тогда
		ДокОбъект = ПередачаВОтгрузку.ПолучитьОбъект();
		ДокОбъект.Статус = СтатусПередачиВОтгрузку;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьДокумент(Команда)	
	ИзменитьОбъект(1);		
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьСтатусДокумент(Команда)
	ИзменитьОбъект(2);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьДокументПодтверждение(Команда)	
	ИзменитьОбъект(3);	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьСтатусДокуменИндивидуальныеУсловияПоставки(Команда)
	ИзменитьОбъект(4);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьДокументПередачаВОтгрузку(Команда)
	ИзменитьОбъект(5);
КонецПроцедуры

&НаСервере
Процедура КомандаОчиститьСчетНаСервере()
	ДокОбъект = ЗаявкаПокупателя.ПолучитьОбъект();
	ДокОбъект.Документы.Очистить();
	ДокОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьСчет(Команда)
	КомандаОчиститьСчетНаСервере();
КонецПроцедуры
