
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Функция ПроверитьРезультатНаСервере(НастройкиДоставки, СообщениеОбОшибке)	
	Возврат ЖБИ_ОбщийМодульСервер.ПроверитьДоставкуСообщения(НастройкиДоставки,СообщениеОбОшибке);			
КонецФункции

#КонецОбласти	

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо записать справочник");
		Возврат;
	КонецЕсли;
	
	СообщениеОбОшибке = "";
	РезультатПроверки = ПроверитьРезультатНаСервере(Объект.Ссылка, СообщениеОбОшибке);
	ОбщегоНазначенияКлиент.СообщитьПользователю(?(Не РезультатПроверки, СообщениеОбОшибке, "Проверка успешно пройдена"));
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

#КонецОбласти

