
#Область ПРОЦЕДУРЫ_И_ФУНКЦИИ_ОБЩЕГО_НАЗНАЧЕНИЯ

&НаСервере
Процедура ЗаполнитьПодписьПользователяПоУмолчанию()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда 
		Возврат;
	КонецЕсли;
	
	ФорматированныйДокумент	= ЖБИ_ОбщегоНазначенияСервер.ПодписьПользователяФорматированныйДокумент();
	ФорматированныйДокумент.Вставить(ФорматированныйДокумент.ПолучитьЗакладкуНачала(),,
		ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	ФорматированныйДокумент.Вставить(ФорматированныйДокумент.ПолучитьЗакладкуНачала(),,
		ТипЭлементаФорматированногоДокумента.ПереводСтроки);

	ДобавитьФорматированныйДокументКФорматированномуДокументу(ТекстПисьмаФорматированныйДокумент, ФорматированныйДокумент);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекстКТеме()	
	
	Если НЕ ЗначениеЗаполнено(Объект.ЖБИ_ШаблонПисьмаТема) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстТемы 			= ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ЖБИ_ШаблонПисьмаТема,"Наименование");
	Текст 				= ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ЖБИ_ШаблонПисьмаТема,"ШаблонСообщения");
	Объект.Тема			= ТекстТемы;
		
	Начало 		= 0; 
	Конец 		= 0;   
    //Получаем в переменные Начало и Конец границы выделения
    Элементы.ТекстПисьмаФорматированныйДокумент.ПолучитьГраницыВыделения(Начало, Конец);
	//Вставляем текст в начало границы выделения
    ВставленныйТекст = ТекстПисьмаФорматированныйДокумент.Вставить(Начало, Текст);
	
	Объект.ТекстHTML	= Текст;
	
КонецПроцедуры


#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_ЭЛЕМЕНТОВ_УПРАВЛЕНИЯ_ФОРМЫ

&НаКлиенте
Процедура ПриИзмененииЖБИ_Тема(Элемент)	
	ДобавитьТекстКТеме();				
КонецПроцедуры

#КонецОбласти

#Область ПРОЦЕДУРЫ_ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ЖБИ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЗаполнитьПодписьПользователяПоУмолчанию();	
КонецПроцедуры

#КонецОбласти
