
&НаСервере
Функция ПолучитьКлючиЗаписиНоменклатураПоставщиков(НоменклатураПоставщика)
	
	Ключ = Новый Структура;
    Ключ.Вставить("Партнер", НоменклатураПоставщика.Владелец);
    Ключ.Вставить("НоменклатураПоставщика", НоменклатураПоставщика);
    КлючЗаписи = РегистрыСведений.ЖБИ_НоменклатураПоставщиков.СоздатьКлючЗаписи(Ключ);
	
    Возврат КлючЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Попытка
		Если СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"ЖБИ_ПодтверждениеПлановыхСтавок.Форма.ФормаДокумента") Тогда 		
			ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ПараметрыВыполненияКоманды.Источник,"ТаблицаТовары");
			Если ТекДанные = Неопределено Тогда 
				Возврат;
			КонецЕсли;			
			КлючЗаписи = ПолучитьКлючиЗаписиНоменклатураПоставщиков(ТекДанные.НоменклатураПоставщика);
			ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
			ОткрытьФорму("РегистрСведений.ЖБИ_НоменклатураПоставщиков.Форма.ФормаЗаписи", ПараметрыФормы);		
		ИначеЕсли СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы,"ЖБИ_ИндивидуальныеУсловияПоставки.Форма.ФормаДокумента") Тогда
			ТекДанные = ЖБИ_ОбщийМодульКлиентСервер.ПроверитьТекСтрокуНаДоступность(ПараметрыВыполненияКоманды.Источник,"Товары");
			Если ТекДанные = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			КлючЗаписи = ПолучитьКлючиЗаписиНоменклатураПоставщиков(ТекДанные.НоменклатураПоставщика);
			ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
			ОткрытьФорму("РегистрСведений.ЖБИ_НоменклатураПоставщиков.Форма.ФормаЗаписи", ПараметрыФормы);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нельзя открыть карточку номенклатуры поставщика, т.к. она не создана в регистре ЖБИ - Номенклатура поставщиков");
	КонецПопытки;
	
КонецПроцедуры
